testing-service-jmeter/tests/suite/JMS_Point_to_Point.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="4.0" jmeter="4.0 r1823414">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="JMS Point_to_Point_ThreadGroup" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">900</stringProp>
      </ThreadGroup>
      <hashTree>
        <JMSSampler guiclass="JMSSamplerGui" testclass="JMSSampler" testname="JMS Point-to-Point" enabled="true">
          <stringProp name="JMSSampler.queueconnectionfactory">ConnectionFactory</stringProp>
          <stringProp name="JMSSampler.SendQueue">dynamicQueues/pacs.008.001.07.request.queue</stringProp>
          <stringProp name="JMSSampler.ReceiveQueue">dynamicQueues/pacs.002.001.09.response.queue</stringProp>
          <intProp name="JMSSampler.communicationStyle">1</intProp>
          <boolProp name="JMSSampler.isNonPersistent">false</boolProp>
          <boolProp name="JMSSampler.useReqMsgIdAsCorrelId">false</boolProp>
          <stringProp name="JMSSampler.timeout">10000</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;Document xmlns=&quot;urn:iso:std:iso:20022:tech:xsd:pacs.008.001.07&quot; xsi:schemaLocation=&quot;urn:iso:std:iso:20022:tech:xsd:pacs.008.001.07 pacs.008.001.07.xsd&quot;
xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;
	&lt;FIToFICstmrCdtTrf&gt;
	
		&lt;GrpHdr&gt;
	
			&lt;MsgId&gt;AAAA/151109-CCT/AUD/${__time(,)}_${__threadNum}&lt;/MsgId&gt;
	
			&lt;CreDtTm&gt;2015-11-09T10:09:13&lt;/CreDtTm&gt;
	
			&lt;NbOfTxs&gt;1&lt;/NbOfTxs&gt;
	
			&lt;SttlmInf&gt;
	
				&lt;SttlmMtd&gt;INDA&lt;/SttlmMtd&gt;
	
			&lt;/SttlmInf&gt;
	
			&lt;InstgAgt&gt;
	
				&lt;FinInstnId&gt;
	
					&lt;BICFI&gt;AAAAGB2L&lt;/BICFI&gt;
	
				&lt;/FinInstnId&gt;
	
			&lt;/InstgAgt&gt;
	
			&lt;InstdAgt&gt;
	
				&lt;FinInstnId&gt;
	
					&lt;BICFI&gt;BBBBIE2D&lt;/BICFI&gt;
	
				&lt;/FinInstnId&gt;
	
			&lt;/InstdAgt&gt;
	
		&lt;/GrpHdr&gt;
	
		&lt;CdtTrfTxInf&gt;
	
			&lt;PmtId&gt;
	
				&lt;InstrId&gt;AAAA/151109-CCT/AUD/443/1&lt;/InstrId&gt;
	
				&lt;EndToEndId&gt;CROPS/SX-25T/2015-10-13&lt;/EndToEndId&gt;
	
				&lt;TxId&gt;AAAA/151109-CCT/AUD/443/1&lt;/TxId&gt;
	
			&lt;/PmtId&gt;
	
			&lt;IntrBkSttlmAmt Ccy=&quot;AUD&quot;&gt;750000&lt;/IntrBkSttlmAmt&gt;
	
			&lt;IntrBkSttlmDt&gt;2015-11-09&lt;/IntrBkSttlmDt&gt;
	
			&lt;InstdAmt Ccy=&quot;AUD&quot;&gt;75000&lt;/InstdAmt&gt;
	
			&lt;ChrgBr&gt;SHAR&lt;/ChrgBr&gt;
	
			&lt;UltmtDbtr&gt;
	
				&lt;Nm&gt;Biogenetics - CROPS&lt;/Nm&gt;
	
				&lt;PstlAdr&gt;
	
					&lt;StrtNm&gt;Growth Street&lt;/StrtNm&gt;
	
					&lt;BldgNb&gt;17&lt;/BldgNb&gt;
	
					&lt;PstCd&gt;G5 OTW&lt;/PstCd&gt;
	
					&lt;TwnNm&gt;Glasgow&lt;/TwnNm&gt;
	
					&lt;Ctry&gt;GB&lt;/Ctry&gt;
	
				&lt;/PstlAdr&gt;
	
			&lt;/UltmtDbtr&gt;
	
			&lt;Dbtr&gt;
	
				&lt;Nm&gt;Biogenetics - HQ&lt;/Nm&gt;
	
				&lt;PstlAdr&gt;
	
					&lt;StrtNm&gt;Corn Street&lt;/StrtNm&gt;
	
					&lt;BldgNb&gt;13&lt;/BldgNb&gt;
	
					&lt;PstCd&gt;W6 8DR&lt;/PstCd&gt;
	
					&lt;TwnNm&gt;London&lt;/TwnNm&gt;
	
					&lt;Ctry&gt;GB&lt;/Ctry&gt;
	
				&lt;/PstlAdr&gt;
	
			&lt;/Dbtr&gt;
	
			&lt;DbtrAcct&gt;
	
				&lt;Id&gt;
	
					&lt;Othr&gt;
	
						&lt;Id&gt;46373892034012&lt;/Id&gt;
	
					&lt;/Othr&gt;
	
				&lt;/Id&gt;
	
			&lt;/DbtrAcct&gt;
	
			&lt;DbtrAgt&gt;
	
				&lt;FinInstnId&gt;
	
					&lt;BICFI&gt;AAAAGB2L&lt;/BICFI&gt;
	
				&lt;/FinInstnId&gt;
	
			&lt;/DbtrAgt&gt;
	
			&lt;CdtrAgt&gt;
	
				&lt;FinInstnId&gt;
	
					&lt;BICFI&gt;BBBBIE2D&lt;/BICFI&gt;
	
				&lt;/FinInstnId&gt;
	
			&lt;/CdtrAgt&gt;
	
			&lt;Cdtr&gt;
	
				&lt;Nm&gt;Seed Inc.&lt;/Nm&gt;
	
				&lt;PstlAdr&gt;
	
					&lt;StrtNm&gt;Grain Lane&lt;/StrtNm&gt;
	
					&lt;BldgNb&gt;27&lt;/BldgNb&gt;
	
					&lt;TwnNm&gt;Dublin&lt;/TwnNm&gt;
	
					&lt;Ctry&gt;IE&lt;/Ctry&gt;
	
				&lt;/PstlAdr&gt;
	
			&lt;/Cdtr&gt;
	
			&lt;CdtrAcct&gt;
	
				&lt;Id&gt;
				
					&lt;Othr&gt;
	
						&lt;Id&gt;46373892034013&lt;/Id&gt;
	
					&lt;/Othr&gt;
	
				&lt;/Id&gt;
	
			&lt;/CdtrAcct&gt;
	
			&lt;Purp&gt;
	
				&lt;Cd&gt;GDDS&lt;/Cd&gt;
	
			&lt;/Purp&gt;
	
			&lt;RmtInf&gt;
	
				&lt;Strd&gt;
	
					&lt;RfrdDocInf&gt;
	
						&lt;Tp&gt;
	
							&lt;CdOrPrtry&gt;
	
								&lt;Cd&gt;CINV&lt;/Cd&gt;
	
							&lt;/CdOrPrtry&gt;
	
						&lt;/Tp&gt;
	
						&lt;Nb&gt;SX-25T&lt;/Nb&gt;
	
						&lt;RltdDt&gt;2015-10-13&lt;/RltdDt&gt;
	
					&lt;/RfrdDocInf&gt;
	
				&lt;/Strd&gt;
	
			&lt;/RmtInf&gt;
	
		&lt;/CdtTrfTxInf&gt;
	
	&lt;/FIToFICstmrCdtTrf&gt;
&lt;/Document&gt;</stringProp>
          <stringProp name="JMSSampler.initialContextFactory">org.apache.activemq.jndi.ActiveMQInitialContextFactory</stringProp>
          <stringProp name="JMSSampler.contextProviderUrl">tcp://192.168.8.102:61616/</stringProp>
          <elementProp name="JMSSampler.jndiProperties" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <elementProp name="arguments" elementType="JMSProperties">
            <collectionProp name="JMSProperties.properties">
              <elementProp name="" elementType="JMSProperty">
                <stringProp name="JMSProperty.name">JMSCorrelationID</stringProp>
                <stringProp name="JMSProperty.value">MesgID-${__time(,)}</stringProp>
                <stringProp name="JMSProperty.type">java.lang.String</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="JMSSampler.priority">9</stringProp>
        </JMSSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1867169789">success</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">500</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Variable" enabled="true">
          <stringProp name="maximumValue">99999</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="outputFormat">00000</stringProp>
          <boolProp name="perThread">false</boolProp>
          <stringProp name="variableName">MsgID</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">10</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="JMS Publisher_ThreadGroup" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">25</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <PublisherSampler guiclass="JMSPublisherGui" testclass="PublisherSampler" testname="JMS Publisher" enabled="true">
          <stringProp name="jms.jndi_properties">false</stringProp>
          <stringProp name="jms.initial_context_factory">org.apache.activemq.jndi.ActiveMQInitialContextFactory</stringProp>
          <stringProp name="jms.provider_url">tcp://192.168.8.100:61616/</stringProp>
          <stringProp name="jms.connection_factory">ConnectionFactory</stringProp>
          <stringProp name="jms.topic">dynamicQueues/pacs.008.001.07.request.queue</stringProp>
          <stringProp name="jms.text_message">&lt;Document xmlns=&quot;urn:iso:std:iso:20022:tech:xsd:pacs.008.001.07&quot; xsi:schemaLocation=&quot;urn:iso:std:iso:20022:tech:xsd:pacs.008.001.07 pacs.008.001.07.xsd&quot;
xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;
	&lt;FIToFICstmrCdtTrf&gt;
	
		&lt;GrpHdr&gt;
	
			&lt;MsgId&gt;AAAA/151109-CCT/AUD/${__time(,)}&lt;/MsgId&gt;
	
			&lt;CreDtTm&gt;2015-11-09T10:09:13&lt;/CreDtTm&gt;
	
			&lt;NbOfTxs&gt;1&lt;/NbOfTxs&gt;
	
			&lt;SttlmInf&gt;
	
				&lt;SttlmMtd&gt;INDA&lt;/SttlmMtd&gt;
	
			&lt;/SttlmInf&gt;
	
			&lt;InstgAgt&gt;
	
				&lt;FinInstnId&gt;
	
					&lt;BICFI&gt;AAAAGB2L&lt;/BICFI&gt;
	
				&lt;/FinInstnId&gt;
	
			&lt;/InstgAgt&gt;
	
			&lt;InstdAgt&gt;
	
				&lt;FinInstnId&gt;
	
					&lt;BICFI&gt;BBBBIE2D&lt;/BICFI&gt;
	
				&lt;/FinInstnId&gt;
	
			&lt;/InstdAgt&gt;
	
		&lt;/GrpHdr&gt;
	
		&lt;CdtTrfTxInf&gt;
	
			&lt;PmtId&gt;
	
				&lt;InstrId&gt;AAAA/151109-CCT/AUD/443/1&lt;/InstrId&gt;
	
				&lt;EndToEndId&gt;CROPS/SX-25T/2015-10-13&lt;/EndToEndId&gt;
	
				&lt;TxId&gt;AAAA/151109-CCT/AUD/443/1&lt;/TxId&gt;
	
			&lt;/PmtId&gt;
	
			&lt;IntrBkSttlmAmt Ccy=&quot;AUD&quot;&gt;750000&lt;/IntrBkSttlmAmt&gt;
	
			&lt;IntrBkSttlmDt&gt;2015-11-09&lt;/IntrBkSttlmDt&gt;
	
			&lt;InstdAmt Ccy=&quot;AUD&quot;&gt;75000&lt;/InstdAmt&gt;
	
			&lt;ChrgBr&gt;SHAR&lt;/ChrgBr&gt;
	
			&lt;UltmtDbtr&gt;
	
				&lt;Nm&gt;Biogenetics - CROPS&lt;/Nm&gt;
	
				&lt;PstlAdr&gt;
	
					&lt;StrtNm&gt;Growth Street&lt;/StrtNm&gt;
	
					&lt;BldgNb&gt;17&lt;/BldgNb&gt;
	
					&lt;PstCd&gt;G5 OTW&lt;/PstCd&gt;
	
					&lt;TwnNm&gt;Glasgow&lt;/TwnNm&gt;
	
					&lt;Ctry&gt;GB&lt;/Ctry&gt;
	
				&lt;/PstlAdr&gt;
	
			&lt;/UltmtDbtr&gt;
	
			&lt;Dbtr&gt;
	
				&lt;Nm&gt;Biogenetics - HQ&lt;/Nm&gt;
	
				&lt;PstlAdr&gt;
	
					&lt;StrtNm&gt;Corn Street&lt;/StrtNm&gt;
	
					&lt;BldgNb&gt;13&lt;/BldgNb&gt;
	
					&lt;PstCd&gt;W6 8DR&lt;/PstCd&gt;
	
					&lt;TwnNm&gt;London&lt;/TwnNm&gt;
	
					&lt;Ctry&gt;GB&lt;/Ctry&gt;
	
				&lt;/PstlAdr&gt;
	
			&lt;/Dbtr&gt;
	
			&lt;DbtrAcct&gt;
	
				&lt;Id&gt;
	
					&lt;Othr&gt;
	
						&lt;Id&gt;46373892034012&lt;/Id&gt;
	
					&lt;/Othr&gt;
	
				&lt;/Id&gt;
	
			&lt;/DbtrAcct&gt;
	
			&lt;DbtrAgt&gt;
	
				&lt;FinInstnId&gt;
	
					&lt;BICFI&gt;AAAAGB2L&lt;/BICFI&gt;
	
				&lt;/FinInstnId&gt;
	
			&lt;/DbtrAgt&gt;
	
			&lt;CdtrAgt&gt;
	
				&lt;FinInstnId&gt;
	
					&lt;BICFI&gt;BBBBIE2D&lt;/BICFI&gt;
	
				&lt;/FinInstnId&gt;
	
			&lt;/CdtrAgt&gt;
	
			&lt;Cdtr&gt;
	
				&lt;Nm&gt;Seed Inc.&lt;/Nm&gt;
	
				&lt;PstlAdr&gt;
	
					&lt;StrtNm&gt;Grain Lane&lt;/StrtNm&gt;
	
					&lt;BldgNb&gt;27&lt;/BldgNb&gt;
	
					&lt;TwnNm&gt;Dublin&lt;/TwnNm&gt;
	
					&lt;Ctry&gt;IE&lt;/Ctry&gt;
	
				&lt;/PstlAdr&gt;
	
			&lt;/Cdtr&gt;
	
			&lt;CdtrAcct&gt;
	
				&lt;Id&gt;
				
					&lt;Othr&gt;
	
						&lt;Id&gt;46373892034013&lt;/Id&gt;
	
					&lt;/Othr&gt;
	
				&lt;/Id&gt;
	
			&lt;/CdtrAcct&gt;
	
			&lt;Purp&gt;
	
				&lt;Cd&gt;GDDS&lt;/Cd&gt;
	
			&lt;/Purp&gt;
	
			&lt;RmtInf&gt;
	
				&lt;Strd&gt;
	
					&lt;RfrdDocInf&gt;
	
						&lt;Tp&gt;
	
							&lt;CdOrPrtry&gt;
	
								&lt;Cd&gt;CINV&lt;/Cd&gt;
	
							&lt;/CdOrPrtry&gt;
	
						&lt;/Tp&gt;
	
						&lt;Nb&gt;SX-25T&lt;/Nb&gt;
	
						&lt;RltdDt&gt;2015-10-13&lt;/RltdDt&gt;
	
					&lt;/RfrdDocInf&gt;
	
				&lt;/Strd&gt;
	
			&lt;/RmtInf&gt;
	
		&lt;/CdtTrfTxInf&gt;
	
	&lt;/FIToFICstmrCdtTrf&gt;
&lt;/Document&gt;</stringProp>
          <stringProp name="jms.config_choice">jms_use_text</stringProp>
          <stringProp name="jms.config_msg_type">jms_text_message</stringProp>
          <stringProp name="jms.iterations">1</stringProp>
          <boolProp name="jms.authenticate">false</boolProp>
          <elementProp name="jms.jmsProperties" elementType="JMSProperties">
            <collectionProp name="JMSProperties.properties"/>
          </elementProp>
        </PublisherSampler>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Variable" enabled="true">
          <stringProp name="maximumValue">99999</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="outputFormat">00000</stringProp>
          <boolProp name="perThread">false</boolProp>
          <stringProp name="variableName">MsgID</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">10</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="JMS Subscriber_ThreadGroup" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">25</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <SubscriberSampler guiclass="JMSSubscriberGui" testclass="SubscriberSampler" testname="JMS Subscriber" enabled="true">
          <stringProp name="jms.jndi_properties">false</stringProp>
          <stringProp name="jms.initial_context_factory">org.apache.activemq.jndi.ActiveMQInitialContextFactory</stringProp>
          <stringProp name="jms.provider_url">tcp://192.168.8.100:61616/</stringProp>
          <stringProp name="jms.connection_factory">ConnectionFactory</stringProp>
          <stringProp name="jms.topic">dynamicQueues/pacs.002.001.09.response.queue</stringProp>
          <boolProp name="jms.authenticate">false</boolProp>
          <stringProp name="jms.iterations">1</stringProp>
          <stringProp name="jms.read_response">true</stringProp>
          <stringProp name="jms.client_choice">jms_subscriber_receive</stringProp>
        </SubscriberSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1867169789">success</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Variable" enabled="true">
          <stringProp name="maximumValue">99999</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="outputFormat">00000</stringProp>
          <boolProp name="perThread">false</boolProp>
          <stringProp name="variableName">MsgID</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">10</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>